frontend/controllers/CourseSubCategoryController.php

	public function actionCreate()
	{
		$model = new CourseSubCategory;

		try {
            if ($model->load($_POST) && $model->save()) {
---
INSERT INTO "course_sub_category" ("id", "description", "course_category") VALUES (1, 'ICANN', 2)