frontend/controllers/CourseCategoryController.php

	public function actionCreate()
	{
		$model = new CourseCategory;

		try {
            if ($model->load($_POST) && $model->save()) {
---
INSERT INTO "course_category" ("id", "description") VALUES (3, 'Information Technology')

	protected function findModel($id)
	{
		if (($model = CourseCategory::findOne($id)) !== null) {
---
SELECT * FROM "course_category" WHERE "id"='2'